package classes;

public class Titulos {

	
	public void tituloAbertura(){
		System.out.print("\n▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓");
		System.out.print("\n▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓");
		System.out.print("\n▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓ 🚀  LAIKA FAST 🚀 ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓");
		System.out.print("\n▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓\n");
		System.out.print("▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓\n");
		System.out.print("\n\t\t\t\t\t\t\t\t\t  Uma experiência de viagem a lua!\n");
		System.out.print("                                                                        ▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔▔                                                                   \n");
		System.out.println("\n\t\t\t\t\t\t\t\t\t        SEJA MUITO BEM-VINDE❗\n\t\t\t\t\t\t\t\t\t         ⭐ 🐱‍🚀 ⭐ ⭐ ⭐ ⭐ ⭐ 🚀 ⭐ ⭐");
	}
	
	public void desejaComprar1() {
		System.out.print("▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃\n");
		System.out.print("\n\n\t\t\t ☛ DESEJA FAZER COMPRAS (S/N)? ");
	}
	
	//Imprime título para tabela de produtos
	public void tituloTabela1() {
		System.out.print("\n▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃▃\n");
		System.out.print("\n\n\t\t\t\t\t\t\t\t\t\t  NOSSOS PRODUTOS\n\n");
		System.out.print("\n▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅\n\n");
	}
	
	public void tituloTabela2() {
		System.out.print("\n                        ╠═══════════════════════════════════════════════════════════════════════════════════════════════════════════╣");
		System.out.print("\n");

	}
	
	public void tituloTabela3() {
		System.out.print("                        ╚═══════════════════════════════════════════════════════════════════════════════════════════════════════════╝\n");
	}
	
	public void carrinhoAberto() {
		System.out.print("\n▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅");
		System.out.print("\n\n\t\t\t🛒 MEU CARRINHO DE COMPRAS\n");
		System.out.print(
				"\t\t\t╒══════════════════════════════════════════════════════════════════════════════════════════════════════╕\n");
	}
	
	public void carrinhoValor(){
		System.out.print("\n\t\t\t┍━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┐");
	}
	
	public void carrinhoValor1() {
	System.out.print("\n\t\t\t┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┙");
	}

	
	public void totalCompra(){
		System.out.print("\t\t\t▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓");
		System.out.print("\n\t\t\t▓▓▓▓▓ LAIKA FAST ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓\n");
		System.out.print("\n\t\t\t┍━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┐\n");
		//System.out.printf("\t\t\t| 🛍️ Valor total da compra: R$ "+valorCompra+", 9%s de imposto sob o valor corresponde a R$ %.2f","%",(valorCompra * 0.9));
		System.out.println("        |");
		System.out.print("\t\t\t┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┙\n");
	}
	
	public void dadosCliente() {
		//Dados do Cliente
		System.out.println("\n\n\t\t\t▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄");
		System.out.print("\n\t\t\t📋 Qual seu nome? ");
		//nome = leia.nextLine();
		System.out.println("\n\n\t\t\t▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄");
		System.out.print("\n\t\t\t📋 Qual seu CPF? ");
		//cpf = leia.nextLine();
	}
	
	public void opcoesPagamento() {
	System.out.println("\n");
	System.out.println("\t\t\t╔═══════════════════════════════════════════════════════════════════════════════════════════════════════╗");
	System.out.print("\t\t\t║\tOPÇÕES DE PAGAMENTO 💳                                                                                       ║"
			+ "\n\t\t\t╠═══════════════════════════════════════════════════════════════════════════════════════════════════════╣");
	System.out.print(
			"\n\t\t\t║\tTemos 3 opções para pagamento:                                                                               ║"
			+ "\n\t\t\t╠═══════════════════════════════════════════════════════════════════════════════════════════════════════╣");
	System.out.print("\n\t\t\t║\t↦ Digite 1 para comprar a vista, com desconto de 10%.                                                 ║");
	System.out.print("\n\t\t\t║\t↦ Digite 2 para comprar no crédito com acrescimo de 10%.                                            ║");
	System.out.print("\n\t\t\t║\t↦ Digite 3 para parcelar em 2 vezes com acrescimo de 15%.\t\t\t\t\t      ║");
	System.out.print("\n\t\t\t╚═══════════════════════════════════════════════════════════════════════════════════════════════════════╝\n");
	System.out.print("\n\n\t\t\t\t☛ Digite aqui: ");
	}
	
	public void notaF1() {
		System.out.print("\n▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅");
		System.out.print("\n\n\t\t\t____________________________________________________________\n");
	}
	
	public void linhaNotaF() {
		System.out.print("\n\t\t\t____________________________________________________________\n");
	}
	
	public void linhaNotaF2() {
		System.out.print("\n\t\t\t____________________________________________________________\n");
		System.out.print("\n\t\t                     AGRADECEMOS PELA PREFERÊNCIA! VOLTE SEMPRE!                                            ");
		System.out.print("\n\t\t\t____________________________________________________________\n");
	}
	
	public void naoComprar() {
		System.out.print("\nATÉ BREVE! ESPERAMOS VER VOCÊ NOVAMENTE! 🐱‍🚀🚀");
	}
	
	public void comprarNovamente(){
		System.out.print("\n▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅▅");
		System.out.print("\n\n\t\t\t🐱‍🚀 Deseja comprar novamente? ");
	}

}
